## PLAN
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.ecr["repo1"].aws_ecr_lifecycle_policy.name["repo1"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 500 images stored"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 500
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "repo1"
    }

  # module.ecr["repo1"].aws_ecr_repository.name["repo1"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "repo1"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "repo1"
        }
+       tags_all             = {
+           "Name" = "repo1"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.ecr["repo2"].aws_ecr_lifecycle_policy.name["repo2"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 500 images stored"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 500
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "repo2"
    }

  # module.ecr["repo2"].aws_ecr_repository.name["repo2"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "repo2"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "repo2"
        }
+       tags_all             = {
+           "Name" = "repo2"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.ecr["repo3"].aws_ecr_lifecycle_policy.name["repo3"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 500 images stored"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 500
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "repo3"
    }

  # module.ecr["repo3"].aws_ecr_repository.name["repo3"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "repo3"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "repo3"
        }
+       tags_all             = {
+           "Name" = "repo3"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
-----

## PLAN
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.ecr["repo1"].aws_ecr_lifecycle_policy.name["repo1"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 500 images stored"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 500
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "repo1"
    }

  # module.ecr["repo1"].aws_ecr_repository.name["repo1"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "repo1"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "repo1"
        }
+       tags_all             = {
+           "Name" = "repo1"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.ecr["repo2"].aws_ecr_lifecycle_policy.name["repo2"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 500 images stored"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 500
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "repo2"
    }

  # module.ecr["repo2"].aws_ecr_repository.name["repo2"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "repo2"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "repo2"
        }
+       tags_all             = {
+           "Name" = "repo2"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.ecr["repo3"].aws_ecr_lifecycle_policy.name["repo3"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 500 images stored"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 500
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "repo3"
    }

  # module.ecr["repo3"].aws_ecr_repository.name["repo3"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "repo3"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "repo3"
        }
+       tags_all             = {
+           "Name" = "repo3"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
-----

Merge to master to apply all of the above